# Brewfile
# Install everything: brew bundle --file=Brewfile
# Check status:       brew bundle check --file=Brewfile
# Update Brewfile:    brew bundle dump --force --file=Brewfile

# Shell + prompt
brew "starship"
brew "zellij"

# File navigation
brew "eza"
brew "zoxide"
brew "fzf"
brew "bat"
brew "fd"

# Search
brew "ripgrep"

# Git
brew "lazygit"
brew "gh"

# Data + APIs
brew "jq"
brew "httpie"

# Python
brew "uv"
brew "ipython"

# Extras
brew "tldr"
brew "delta"
brew "direnv"

# macOS only
cask "ghostty"
cask "font-jetbrains-mono-nerd-font"
